{
    "name": "Source Control, DOM and Require.js",
    "order": 5,
    "time": "5 hours",
    "helpRoom": "Help",
    "challenges": [
        {
          "id": "135344b054934be52b430443",
          "title": "***Commit to <strong>not</strong> solve other students problems, share code or give away answers***",
          "description": [
            [
              "",
              "",
              "Computer programming requires excelent problem solving skills. Working through problems with the help of documentation is a daily activity for all programmers.",
              ""
            ],
            [
              "",
              "",
              "When students give help it should only be to point out where in the documentation, books or other materials where they can learn about a concept.",
              ""
            ],
            [
              "",
              "",
              "Students should never give away a solution to a problem or share code that completes a problem.",
              ""
            ],
            [
              "",
              "",
              "If a student is still unable to solve a problem, please, refer them to the tutor.",
              ""
            ],
            [
              "",
              "",
              "By clicking below you commit to <strong>not</strong> solve other students problems, share code or give away answers.",
              "#"
            ]
          ],
          "releasedOn": "May 10, 2018",
          "challengeSeed": [],
          "tests": [],
          "type": "Waypoint",
          "challengeType": 7,
          "isRequired": false
        },
          {
            "id": "524027405490e943fc504e97",
            "title": "Egg Popup",
            "description": [
                "Build the Egg Popup as seen in the bellow image.",
                "<img src='http://codecamp.edu/educationMaterials/projects/workbenchProjects/eletronic-life/electron-life.png'>",
                "<strong>Technology Stack:</strong> 1. Use only HTML, CSS, JavaScript, and DOM, do NOT use any libraries.",
                "The images can be found and linked to here <a href='http://codecamp.edu/educationMaterials/projects/workbenchProjects/egg-popup' target='_blank'>animateworld.js</a> script will create the <strong>user interface</strong> in the browser (in a later challenge you will create your own interface).",
                "Remember to use the Research-Ask method if you get stuck."
            ],
            "releasedOn": "May 10, 2018",
            "challengeSeed": [
              "cDIfODs"
            ],
            "tests": [],
            "type": "zipline",
            "isRequired": true,
            "challengeType": 3,
            "translations": {}
          }
        ]
      }
      